Revit 2024 API
MultiReferenceAnnotation.IsLinearFixedDimensionDirectionValid Method
 If the DimensionStyleType is LinearFixed, this function verifies that the dimension line direction matches either the view's vertical or horizontal direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsLinearFixedDimensionDirectionValid(
	Document document,
	ElementId viewId,
	MultiReferenceAnnotationOptions options
)
Visual Basic
Public Shared Function IsLinearFixedDimensionDirectionValid ( _
	document As Document, _
	viewId As ElementId, _
	options As MultiReferenceAnnotationOptions _
) As Boolean
Visual C++
public:
static bool IsLinearFixedDimensionDirectionValid(
	Document^ document,
	ElementId^ viewId,
	MultiReferenceAnnotationOptions^ options
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document for the view.
viewId
Type: Autodesk.Revit.DB.ElementId
 The view in which the dimension line direction will be tested.
options
Type: Autodesk.Revit.DB.MultiReferenceAnnotationOptions
 Options containing the DimensionStyleType and dimension line direction to test.
Return Value
 True if the DimensionStyleType is LinearFixed and the dimension line direction can be used in the view. True if the DimensionStyleType is not LinearFixed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace